Обработки/Reports/_КлиентыПоАгентскимДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КлиентыПоАгентскимДоговорам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КлиентыПоАгентскимДоговорам/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Клиенты по агентским договорам", 
		"0.11", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтчетПоРНБЗаВчерашнийДень", "Отправка отчета по РНБ за предыдущий рабочий день", , Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтчетПоДВБЗаВчерашнийДень", "Отправка отчета по ДВБ за предыдущий рабочий день", , Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтчетПоМКБЗаВчерашнийДень", "Отправка отчета по МКБ за предыдущий рабочий день", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт

	ПриВыполненииВозниклиОшибки = Ложь;
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если ИдентификаторКоманды <> "АвтоОтчетПоРНБЗаВчерашнийДень"
		И ИдентификаторКоманды <> "АвтоОтчетПоДВБЗаВчерашнийДень"
		И ИдентификаторКоманды <> "АвтоОтчетПоМКБЗаВчерашнийДень"
	Тогда
		ЗарегистрироватьОшибку("Неизвестный идентификатор команды '" + ИдентификаторКоманды + "'");
		ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
	
	// Заполняем параметры	
	ЭтотОбъект.Период = КонецДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()) - 1));
	
	Если Не ПараметрыКоманды.Свойство("Организация", ЭтотОбъект.Организация) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ПриВыполненииВозниклиОшибки = Истина;
		ЗарегистрироватьОшибку("Не указан или не заполнен параметр ""Организация""");
	КонецЕсли;
	
	Если Не ПараметрыКоманды.Свойство("Агент", ЭтотОбъект.Агент) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.Агент) Тогда
		ПриВыполненииВозниклиОшибки = Истина;
		ЗарегистрироватьОшибку("Не указан или не заполнен параметр ""Агент""");
	КонецЕсли;	
	
	Адресаты = Неопределено;
	Если Не ПараметрыКоманды.Свойство("Адресаты", Адресаты) ИЛИ Не ЗначениеЗаполнено(Адресаты) Тогда
		ПриВыполненииВозниклиОшибки = Истина;
		ЗарегистрироватьОшибку("Не указан или не заполнен параметр ""Адресаты""");
	КонецЕсли;	
		
	Если Не ПриВыполненииВозниклиОшибки Тогда
		СформироватьИОтправитьОтчет(Адресаты);
	КонецЕсли;
	
	ОповеститьОбОшибках();	
	
КонецПроцедуры // ВыполнитьКоманду

Процедура СформироватьИОтправитьОтчет(Адресаты)
	
	// Формируем
	Отчет = Новый ТабличныйДокумент;
	ЭтотОбъект.СкомпоноватьРезультат(Отчет);
	
	// Отправляем
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
	Отчет.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Вложения = Новый Соответствие;
	Вложения.Вставить("Клиенты по агентским договорам " + ЭтотОбъект.Агент + " на конец " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") + ".xlsx", Новый Файл(ИмяВременногоФайла));
	
	Попытка
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(
			Адресаты,
			"Клиенты по агентским договорам " + ЭтотОбъект.Агент + " на конец " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"),
			"Клиенты по агентским договорам " + ЭтотОбъект.Агент + " на конец " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"),
			Вложения,
			РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
			Истина
		);
	Исключение
		ЗарегистрироватьОшибку("Ошибка отправки отчета на электронную почту: " + ОписаниеОшибки());
	КонецПопытки;
	
	УдалитьФайлы(ИмяВременногоФайла);
		
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Период",		КонецДня(ЭтотОбъект.Период));
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация",	ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("Агент",		ЭтотОбъект.Агент);
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#Область Вспомогательные_функции
Процедура ЗарегистрироватьОшибку(ТекстОшибки)	
	
	ДополнительныеСвойства = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	Если Не ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ДополнительныеСвойства = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	ЕстьОшибки = ДополнительныеСвойства.Свойство("Ошибки");
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ДополнительныеСвойства.Ошибки, ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

#КонецОбласти
